[
  {
    "title": "Edinburgh Castle",
    "address": "Castlehill, Edinburgh EH1 2NG, United Kingdom",
    "description": "Edinburgh Castle dominates Scotland's capital city from its\ngreat rock. Its story has helped shape the nation's story.",
    "history": "Battles and sieges were fought over it, royalty lived and\ndied within its walls, and countless generations have been and inspired by it.\n\n\n\n \n\n\n\nAncient Stronghold\n\n\n\nFierce Iron Age warriors defended a hill fort here, and the\nnation's oldest poetry tells of a war band feasting here for a year before\nriding to their deaths in battle.\n\n\n\n \n\n\n\nThe Scots and English struggled for control of the castle\nduring the Wars of Independence. In 1314 it was recaptured from the English in\na daring night raid led by Thomas Randolph, nephew of King Robert the Bruce.\n\n\n\n \n\n\n\nHome of Royalty\n\n\n\nThe castle has sheltered many Scottish monarchs. They\ninclude Queen Margaret (later St Margaret), who died here in 1093, and Mary\nQueen of Scots, who gave birth to James VI in the Royal Palace in 1566.\n\n\n\n \n\n\n\nHer great-great-great grandson Charles Edward Stuart -\nBonnie Prince Charlie - captured Edinburgh but was unable to take the castle\nduring the 1745-6 Jacobite Rising.\n\n\n\n \n\n\n\nIn 1996, the Stone of Destiny, on which kings were enthroned\nfor centuries, was returned to Scotland. It is now displayed in the Crown Room.\n\n\n\n \n\n\n\nArmy Headquarters\n\n\n\nIn the 1600s, the castle became a military base. Some\nbuildings were rebuilt and new ones were raised to house a huge garrison - and\nprovide a secure jail for prisoners of war.\n\n\n\n \n\n\nThe military presence remains unbroken, but over\nthe last 200 years the castle has become a national icon. It is now Scotland's\nleading tourist attraction, and a key element of the Edinburgh World Heritage\nSite.",
    "how_to_approch": "By air\n\n\n\nThe nearest airport is BAA Edinburgh. General enquiries +44\n(0) 870 040 0007 or visit\n\n\n\n \n\n\n\nwww.edinburghairport.com\n\n\n\n \n\n\n\nBy rail\n\n\n\nWaverley Station is the main railway station in the Scottish\ncapital. The station is located on the east end of Princes Street and is\nserviced by most major rail transport providers. The Castle is visible and\naccessible from its exits. From Princes Street, travel up Waverley Bridge, The\nMound, Mound Place, Ramsay Lane to arrive at the Castle esplanade.\n\n\n\n \n\n\n\nHaymarket Station is situated on the west end of Princes\nStreet.\n\n\n\n \n\n\n\nBy bus\n\n\n\nThere is an express bus service from the airport - Airlink\n100 - to Edinburgh city centre. Tickets can be purchased from the information\ndesk at International Arrivals at the airport or on the bus.\n\n\n\n \n\n\n\nThe journey takes approximately 25 minutes and terminates at\nWaverly Bridge, near to the main railway station.\n\n\n\n \n\n\n\nVisit www.lothianbuses.com or www.flybybus.com\n\n\n\n \n\n\n\nBy car\n\n\n\nParking is unavailable at the castle. The nearest city\nparking zones are located at Castle Terrace and Johnston Terrace. Visit NCP car\npark website for additional information on directions and parking fees.\n\n\n\n \n\n\nThere are limited spaces for disabled visitors\nat the castle, please book in advance by telephoning 0131 310 5114.",
    "tickets": "Ticket Types & Prices\n\n\n\nCATEGORY          April\n2013 - March 2015\n\n\n\nAdult (16-59yrs)                £16.00\n\n\n\nChild (5-15yrs)   £9.60\n\n\n\nConcession (60yrs+ and unemployed) *                £12.80\n\n\n\nChildren must be accompanied by an adult. Under 5 year olds\ngo free.\n\n\n\n \n\n\n\nLast admission is 1 hour before closing.\n\n\n\n \n\n\n\nPlease be aware prices are subject to change and may also\nvary for special events.\n\n\n\n \n\n\n* Proof of eligibility is required. Benefits\ninclude, Jobseeker's Allowance (applies to UK residents only and an ES40 form\nis required); ESA (formerly the Incapacity Benefit); and Universal Credit.\nStudents do not qualify as concessions.",
    "timings": "",
    "contact": "+44 (0)131 668 8686",
    "distance": "",
    "thumbnail": "EdinburghCastle-thumb",
    "images": [
      "EdinburghCastle1",
      "EdinburghCastle2",
      "EdinburghCastle3",
      "EdinburghCastle4",
      "EdinburghCastle5"
    ],
    "coordinates": {
      "lat": "55.948598",
      "lng": "-3.199956"
    }
  },
  {
    "title": "EileanDonan",
    "address": "",
    "description": "As one of the most\niconic images of Scotland, Eilean Donan is recognised all around the world.\nSituated on an island at the point where three great sea lochs meet, and\nsurrounded by some majestic scenery, it is little wonder that the castle is now\none of the most visited and important attractions in the Scottish highlands.",
    "history": "Although first inhabited around the 6th century, the first\nfortified castle was built in the mid 13th century and stood guard over the\nlands of Kintail. Since then, at least four different versions of the castle\nhave been built and re-built as the feudal history of Scotland unfolded through\nthe centuries. \n\n\n\n \n\n\n\nPartially destroyed in a Jacobite uprising in 1719, Eilean\nDonan lay in ruins for the best part of 200 years until Lieutenant Colonel John\nMacRae-Gilstrap bought the island in 1911 and proceeded to restore the castle\nto its former glory. After 20 years of toil and labour the castle was re-opened\nin 1932. \n\n\n\n \n\n\n\nToday, you can explore nearly every part of the castle, and\nenjoy a journey through the history of the area.\n\n\n\n \n\n\n\nThe Castle now has its own visitor centre, which includes\nthe Ticket Office, Coffee Shop, Gift Shop and toilets.\n\n\n\n \n\n\n\nAmple Car parking is available at no charge, and we also\nwelcome large parties and groups. \n\n\n\n \n\n\n\nAlthough we have no disabled or wheelchair access into the\ncastle itself, we do have a computer-based Virtual Tour available for those\nthat are unable to manage the large number of steps. Please ask at the visitor\ncentre if you require this facility.\n\n\n\n \n\n\nSome people say Eilean Donan is the most\nbeautiful castle in Scotland. Come and decide for yourself!",
    "how_to_approch": "Several companies offer guided day trips to visit Eilean\nDonan from a variety of different locations. Some also offer longer tours of\nthe Scottish highlands.\n\n\n\n \n\n\n\nFrom Inverness\n\n\n\nThe Hebridean Explorer www.thehebrideanexplorer.com or call\n0794 3863292\n\n\n\n \n\n\n\nHighland Tours     \nwww.highlandtours.com or call 0871 2000611\n\n\n\n \n\n\n\nWOW Scotland      \nwww.wowscotlandtours.com or call 07919 157067\n\n\n\n \n\n\n\nFrom Edinburgh\n\n\n\nHaggis Adventures    \nwww.HAGGISadventures.com  or call\n0131 557 9393\n\n\n\n \n\n\n\nMacBACKPACKERS  \nwww.macbackpackers.com or call 0131 558 9900\n\n\n\n \n\n\n\nTimberbush Tours    \nwww.timberbush-tours.co.uk or call 0131 226 6066\n\n\n\n \n\n\n\nRabbies Trailburners www.rabbies.com or call 0131 226 3133\n\n\n\n \n\n\n\nHighland Experience Tours \nwww.highlandexperience.com  or\ncall 0131226 1414\n\n\n\n \n\n\n\nReal Scottish Journeys  \nwww.realscottishjourneys.com or call 01620 895280\n\n\n\n \n\n\n\nFrom Glasgow\n\n\nTimberbush Tours      www.timberbush-tours.co.uk or call 0131\n226 6066",
    "tickets": "Adults   £6.50\n\n\n\n \n\n\n\nConcessions\n\n\n\n(Students & Seniors,)     \n\n\n\n£5.50\n\n\n\n \n\n\n\nFamily\n\n\n\n(2 Adults + 3 Children Age 5-15) \n\n\n\n£16.00\n\n\n\n \n\n\n\nUnder 5s              \n\n\n\nFREE\n\n\n\n \n\n\n\nGroup Rate (min 12 persons)      \n\n\n£5.50",
    "timings": "Opening Hours\n\n\n\nThe Castle \n\n\n\n& Exhibitions      Every\nday 1st Feb - 31st Dec\n\n\n\n10.00am - 6.00pm\n\n\n\n(Last Admission 5.00)\n\n\n\n \n\n\n\nN.B - Castle opens at 9.30am in June and 9.00am in July\n& August.\n\n\n\n \n\n\n\nThe Visitor Centre (Reception, Coffee shop & Toilets)    10.00am - 5.00pm\n\n\n\nEvery day 12 March - 27th Oct\n\n\n\n \n\n\n\nGift shop             \n\n\n\nOpen February - December\n\n\n10.00am - 5.00pm",
    "contact": "0131 557 9393",
    "distance": "",
    "thumbnail": "EileanDonan-thumb",
    "images": [
      "EileanDonan1",
      "EileanDonan2",
      "EileanDonan3",
      "EileanDonan4",
      "EileanDonan5"
    ],
    "coordinates": {
      "lat": "57.274044",
      "lng": "-5.516137"
    }
  },
  {
    "title": "Ben Nevis ",
    "address": "",
    "description": "Ben Nevis (Scottish\nGaelic: Beinn Nibheis) is the highest mountain in the British Isles. It is\nlocated at the western end of the Grampian Mountains in the Lochaber area of\nScotland, close to the town of Fort William and is affectionately known as 'The\nBen.'",
    "history": "Ben Nevis attracts an estimated 125,000 complete and a\nfurther 100,000 partial ascents per year, most of which are made by walkers\nusing the well-constructed Mountain Track (Pony Track) from Glen Nevis on the\nsouth side of the mountain. For climbers and mountaineers the main attraction\nlies in the 700-metre (2,300 ft) high cliffs of the north face. Among the\nhighest cliffs in the United Kingdom, they harbour some of the best scrambles\nand rock climbs at all levels of difficulty, and are one of the principal\nlocations in the UK for ice climbing.\n\n\n\n \n\n\nThe summit, at 1,344 metres (4,408 ft) above sea\nlevel, unusually for a mountain in Scotland, features the ruins of a building,\nan observatory, which was permanently staffed from 1883 until it's closure in\n1904.",
    "how_to_approch": "",
    "tickets": "",
    "timings": "",
    "contact": "01397\n705922",
    "thumbnail": "BenNevis-thumb",
    "images": [
      "BenNevis1",
      "BenNevis2",
      "BenNevis3",
      "BenNevis4",
      "BenNevis5"
    ],
    "coordinates": {
      "lat": "56.797021",
      "lng": "-5.003563"
    }
  },
  {
    "title": "Loch Ness",
    "address": "",
    "description": "Loch Ness (/ˌlɒx ˈnɛs/;\nScottish Gaelic: Loch Nis, [l̪ˠɔxˈniʃ]) is a large, deep, freshwater loch in\nthe Scottish Highlands extending for approximately 37 kilometres (23 mi)\nsouthwest of Inverness. Its surface is 15.8 m (52 ft) above sea level. Loch\nNess is best known for alleged sightings of the cryptozoological Loch Ness\nMonster, also known affectionately as \"Nessie\". ",
    "history": "It is connected at\nthe southern end by the River Oich and a section of the Caledonian Canal to\nLoch Oich. At the northern end there is the Bona Narrows which opens out into\nLoch Dochfour, which feeds the River Ness and a further section of canal to\nInverness. It is one of a series of interconnected, murky bodies of water in\nScotland; its water visibility is exceptionally low due to a high peat content\nin the surrounding soil.",
    "how_to_approch": "",
    "tickets": "",
    "timings": "",
    "contact": "",
    "thumbnail": "LochNess-thum",
    "images": [
      "LochNess1",
      "LochNess2",
      "LochNess3",
      "LochNess4",
      "LochNess5"
    ],
    "coordinates": {
      "lat": "57.344128",
      "lng": "-4.420621"
    }
  },
  {
    "title": "Luskentyre Beach",
    "address": "",
    "description": "",
    "history": "",
    "how_to_approch": "",
    "tickets": "",
    "timings": "",
    "contact": "",
    "distance": "",
    "thumbnail": "LuskentyreBeach3-thumb",
    "images": [
      "LuskentyreBeach1",
      "LuskentyreBeach2",
      "LuskentyreBeach3"
    ],
    "coordinates": {
      "lat": "",
      "lng": ""
    }
  },
  {
    "title": "Stirling Castle",
    "address": "",
    "description": "Stirling Castle is a great symbol of Scottish independence\n& a source of national pride. Knights, nobles and foreign ambassadors once\nflocked to the Royal Court at Stirling Castle to revel in the castle's\ngrandeur.",
    "history": "A place of power, beauty and history, discover\nthe favoured residence of Scotland's Kings and Queens!",
    "how_to_approch": "",
    "tickets": "ADMISSION PRICES\n\n\n\n \n\n\n\nAdult: £14.00\n\n\n\n(aged 16-59)\n\n\n\n \n\n\n\nChild £7.50\n\n\n\n(aged 5-15. Children must be accompanied by an adult or\nconcession visitor).\n\n\n\n \n\n\n\nConcession: £11.00\n\n\n\n(aged 60 and over, unemployed)\n\n\n\n \n\n\n\nChild under 5 - FREE\n\n\n\n \n\n\n\n \n\n\n\nHistoric Scotland Members\n\n\n\nMembers of Historic Scotland get free entry & 20%\ndiscount in our shops. Become a Member.\n\n\n\n \n\n\n\nGroup Bookings\n\n\nFor group bookings of 11 people or more please\ncall: +44(0) 131 668 8831/8664 or email Travel Trade",
    "timings": "SUMMER\n\n\n\n1 April - 30 September\n\n\n\nMon Tue Wed Thu Fri Sat Sun, 9.30 am to 6.00 pm\n\n\n\n \n\n\n\nWINTER\n\n\n\n1 October - 31 March\n\n\n\nMon Tue Wed Thu Fri Sat Sun, 9.30 am to 5.00 pm\n\n\n\n \n\n\n\nLast Entry\n\n\n\nLast ticket sold 45 mins before closing. The Regimental\nMuseum closes 45 mins before the castle. To check opening hours please\ntelephone + 44 (0) 1786 450 000.\n\n\n\n \n\n\n\nChristmas and New Year\n\n\nWe will be closed on Christmas Day and Boxing\nday. We will be open from 11am to 5pm on January 1st and as normal from January\n2nd",
    "contact": "+44 (0) 1786 450 000",
    "distance": "",
    "thumbnail": "StirlingCastle-thumb",
    "images": [
      "StirlingCastle1",
      "StirlingCastle2",
      "StirlingCastle3",
      "StirlingCastle3",
      "StirlingCastle3"
    ],
    "coordinates": {
      "lat": 56.123919,
      "lng": -3.947417
    }
  },
  {
    "title": "Skara Brae",
    "address": "",
    "description": "The neolithic\nsettlement of Skara Brae lies near the dramatic white beach of the Bay of\nSkaill. Skara Brae is the best preserved groups of prehistoric houses in\nWestern Europe. ",
    "history": "Uncovered by a storm in 1850, the attraction presents a\nremarkable picture of life around 5,000 years ago. \n\n\n\n \n\n\n\nVisitors can experience a vivid impression of the realities\nof a prehistoric village and see ancient homes fitted with stone beds, dressers\nand seats. A replica construction allows visitors to fully understand the\ninterior of a prehistoric house. \n\n\n\n \n\n\n\nAn informative visitor centre provides touch-screen\npresentations, fact-finding quizzes for children and adults, and an opportunity\nto see artefacts discovered during archaeological excavations in the 1970s. \n\n\n\n \n\n\nThere is a cafe (which may have restricted\nopening hours in the winter) and a well stocked gift shop selling locally-made\nsouvenirs and crafts.",
    "how_to_approch": "",
    "tickets": "Admission prices\n\n\n\nEntry to Skara Brae and Skaill House (Apr-Oct)\n\n\n\nAdult £7.10, Child £4.30, Concession £5.70\n\n\n\nEntry to Skara Brae only (Nov-Mar)\n\n\nAdult £6.10, Child £3.70, Concession £4.90",
    "timings": "Winter\n\n\n1 October - 31 March, Mon Tue Wed Thu Fri Sat\nSun, 9.30 am to 4.30 pm",
    "contact": "01856 841 815",
    "distance": "",
    "thumbnail": "SkaraBrae-thumb",
    "images": [
      "SkaraBrae1",
      "SkaraBrae2",
      "SkaraBrae3",
      "SkaraBrae4",
      "SkaraBrae5"
    ],
    "coordinates": {
      "lat": 59.048905,
      "lng": -3.341709
    }
  },
  {
    "title": "Cuillin Hills",
    "address": "",
    "description": "The Cuillin (Scottish Gaelic: An Cuilthionn or An\nCuiltheann) is a range of rocky mountains located on the Isle of Skye in\nScotland. The true Cuillin is also known as the Black Cuillin to distinguish it\nfrom the Red Cuilin (na Beanntan Dearga, known locally as Red Hills) across\nGlen Sligachan. The Red Cuilin hills are lower and, being less rocky, have\nfewer scrambles or climbs.",
    "history": "The Battle of Coire Na Creiche was fought on the slopes\nbelow Bruach na Frìthe in 1601. It was the last Scottish clan battle fought on\nSkye, in which the Clan MacDonald of Sleat defeated the Clan MacLeod after a\nbitter feud.\n\n\n\n \n\n\n\nIn 2000 the Cuillin were put on sale for £10 million by the\nLaird in a scheme of land in exchange for repairs to Dunvegan castle.[4]\nFollowing a dispute over ownership, a deal was cut for the property to be\ngifted in return for repairs to the clan castle.[4]\n\n\n\n \n\n\nThere is a legend that the Cuillins are haunted\nby the ghost of an outlaw called MacRaing.[5]",
    "how_to_approch": "",
    "tickets": "",
    "timings": "",
    "contact": "01478 612003",
    "distance": "",
    "thumbnail": "CuillinHills-thumb",
    "images": [
      "EdinburghCastle1",
      "EdinburghCastle2",
      "EdinburghCastle3",
      "EdinburghCastle4",
      "EdinburghCastle5"
    ],
    "coordinates": {
      "lat": 57.21685,
      "lng": -6.216688
    }
  },
  {
    "title": "Melrose Abbey",
    "address": "",
    "description": "Melrose Abbey is a magnificent ruin on a grand scale with\nlavishly decorated masonry.",
    "history": "The Abbey is the burial place of Robert the\nBruce’s heart, marked with a commemorative carved stone plaque within the\ngrounds. Visitors can also visit a small museum housing a display of artefacts\nfound within the abbey.",
    "how_to_approch": "",
    "tickets": "All year\n\n\nAdult £5.50, Child £3.30, Concession £4.40",
    "timings": "Opening arrangements\n\n\n\nSummer\n\n\n\n1 April - 30 September, Mon Tue Wed Thu Fri Sat Sun, 9.30 am\nto 5.30 pm\n\n\n\nWinter\n\n\n1 October - 31 March , Mon Tue Wed Thu Fri Sat\nSun, 9.30 am to 4.30 pm",
    "contact": "01896 822 562",
    "distance": "",
    "thumbnail": "MelroseAbbey-thumb",
    "images": [
      "MelroseAbbey1",
      "MelroseAbbey2",
      "MelroseAbbey3",
      "MelroseAbbey4",
      "MelroseAbbey5"
    ],
    "coordinates": {
      "lat": 55.599252,
      "lng": -2.717828
    }
  },
  {
    "title": "Broch of Mousa",
    "address": "",
    "description": "There is an\nextraordinary sensation as you step ashore on Mousa that you have come to a\nspecial place. A place where you can see and feel the ages of time with its\narchaeological sites, desolate ruins and most famously the Mousa Broch – the\nbest preserved Iron Age tower in existence, where the visitor can still climb\nthe staircase to marvel at the commanding view and workmanship of this 2000\nyear-old building. The broch is truly legendary featuring in a couple of the\nold Norse Sagas as a place of captivity and hiding, and in comparatively more\nrecent times as the secret store for smugglers.",
    "history": "Mousa (“Mossy Island” in Old Norse) today is an RSPB Nature\nReserve with important breeding colonies of seals and seabirds including the\ndiminutive storm petrel, hundreds of which have made their home within the\nmighty broch walls. There are many opportunities for visitors to observe a\nrange of plant and wildlife including some quite rare species, and you may even\nbe fortunate enough to catch sight of an elusive otter or passing whale!\n\n\n\n \n\n\nMousa has many stories to tell in its long\nhistory some of which may be myths, but one thing we do know, a visit to this\ndelightful island will have a special place in your memory for a long time to\ncome.",
    "how_to_approch": "The journey begins at the historic Sandsayre pier, where the\nold boatshed, complete with a former ‘flit’ boat, has been developed into a\nfascinating interpretive centre to provide an insight into the life and times\nof the local area. Sail over to Mousa for a fascinating and memorable trip on\nthe island - most famously the Mousa Broch, but the island is a RSPB Nature\nReserve and home to many breeding wildlife, colonies of seals and birds - there\nis so much to see and do on Mousa Island. \n\n\n\n \n\n\n\nThis trip operates daily (except Saturday) from April to\nmid-September and booking is not required for the daily Mousa Island Trip. \n\n\n\n \n\n\nPlease don’t leave your trip to the last day of\nyour visit to Shetland though, as all sailings are weather dependant. You can\ncheck your sailing is operating two hours before departure by checking the\nSailing Information Update on this website. All sailings depart from Sandsayre\npier, Sandwick unless otherwise advised.",
    "tickets": "Adult      £16.00\n\n\n\nConcession         \n£14.00\n\n\nChildren (5-16 years)       £7.00",
    "timings": "Operates from April to mid-September\n\n\n\nMonday, Tuesday, Thursday, Friday        Depart 13:00hrs                Return\n16:15hours\n\n\n\nWednesday        Depart\n10:00hrs                Return 13:15hours\n\n\n\nSunday Depart 13:30hrs                Return 16:30hours\n\n\nSaturday              No\nDay Time Sailing",
    "contact": "+44 (0)7901 872339",
    "distance": "",
    "thumbnail": "MousaBroch-thumb",
    "images": [
      "MousaBroch1",
      "MousaBroch2",
      "MousaBroch3",
      "MousaBroch4",
      "MousaBroch5"
    ],
    "coordinates": {
      "lat": 59.995419,
      "lng": -1.182135
    }
  }
]